Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པ་ཐ་དད་པ་ཐམས་ཅད་ཤེས་པར་བྱ་བའི་ཚུལ་དང་། རྣམ་པ་ལ་མཁས་པ།
en: she was skilled in the aspects and ways of knowing all the different world realms;

source: ཞིང་ཐ་དད་པའི་ཚུལ་ཐམས་ཅད་ཤེས་པར་བྱ་བའི་ཚུལ་ལ་མཁས་པའི་རྗེས་སུ་སོང་བ།
en: she had acquired skill in the ways of knowing all the modes of different realms;

source: ཡེ་ཤེས་ཀྱི་ལྟ་བ་ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་རབ་ཏུ་འདལ་བ།
en: she spread the view of wisdom throughout the ocean of all directions;

source: དུས་རྒ་མཚོ་ཐམས་ཅད་དུ་ཁྱབ་པའི་བློ་དང་ལྡན་པ།
en: she had the understanding that pervades all the ocean of all time;

source: སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་མངོན་སུམ་དུ་འདུད་པའི་ལུས་ཅན།
en: she had bodies that bow down directly to the ocean of all buddhas;

source: ཆོས་ཀྱི་སྤྲིན་རྒྱ་མཚོའི་ཆར་ཐམས་ཅད་ཡང་དག་པར་གཟུང་བ་ལ། མངོན་ཏུ་གྱུར་པའི་སེམས་དང་ལྡན་པ།
en: she had a mind that directly acquired all the rain from the ocean of the clouds of the Dharma;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་རབ་ཏུ་རྫོགས་པར་བྱ་བའི་ནན་ཏན་གྱིས་འབྱུང་བ་ལ་རབ་ཏུ་བརྩོན་པ།
en: she was dedicated to coming forth through the practice of completing the qualities of all the tathāgatas;

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པ་ལ་རབ་ཏུ་ཞུགས་པའི་བློ་དང་ལྡན་པ།
en: she had the understanding that engaged in accomplishing all the accumulations of the bodhisattvas;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རབ་ཏུ་འཇུག་པ་ལ་རྣམ་པར་དཔྱོད་པའི་མཐུ་ཡོད་པ།
en: she possessed the power of analyzing the progress of all bodhisattvas;

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་ཐམས་ཅད་ཡོངས་སུ་གྲུབ་པ།
en: she accomplished all the aspects of the aspiration to enlightenment;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱང་བ་ལ་རབ་ཏུ་བརྩོན་པ།
en: she was engaged in protecting all bodhisattvas;

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ལེགས་པའི་སྤྲིན་ཀུན་ཏུ་སྣང་བ་རབ་ཏུ་སྟོན་པ།
en: she manifested the light of the clouds of the goodness of all buddhas;

source: བྱང་ཆུབ་སེམས་དཔའ་དང་རྒྱལ་བ་ཐམས་ཅད་སྐྱེད་པའི་སྨོན་ལམ་གྱིས་བྱུང་བ་དང་། དེ་དག་ལ་སོགས་པ་མཐོང་བའི་ཚུལ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ལྷ་མོ་སྒྱུ་མ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་བར་གྱུར་ཏོ།
en: and she had arisen from the prayers that give birth to all bodhisattvas and jinas. Sudhana, the head merchant’s son, saw Māyādevī in those ways and in other ways as numerous as the atoms in Jambudvīpa.

source: །དེས་དེ་མཐོང་ནས་ལྷ་མོ་སྒྱུ་མ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་དུ་བདག་གི་ལུས་བྱིན་གྱིས་བརླབས་ནས། ཕྱོགས་ཐམས་ཅད་ལ་མངོན་ཏུ་བལྟས་པའི་ལྷ་མོ་སྒྱུ་མ་ལ་ཐམས་ཅད་དུ་ཁྱབ་པའི་ལུས་ཀྱིས་ཕྱག་བྱས་སོ།
en: Having seen that, he blessed his own body to be as numerous as those of Māyādevī and bowed down to them with bodies that spread among them all.

source: །དེས་དེ་ལྟར་ཕྱག་བྱས་མ་ཐག་ཏུ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མཐའ་དང་དབུས་མེད་པ་ཐོབ་པར་གྱུར་ཏེ།
en: The instant he bowed down, he attained a vast extent, without middle or end, of entrances to samādhi.

source: དེས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དེ་དག་ལ་རྣམ་པར་བལྟས་ནས། མཚན་མར་བྱ་བ་དང་། བསྒོམ་པ་དང་། ལྷུར་བླང་བ་དང་། རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། རྒྱས་པར་དགང་བ་དང་། རབ་ཏུ་རྒྱ་ཆེར་བྱ་བ་དང་། བལྟ་བ་དང་། རྣམ་པར་སྤེལ་བ་དང་། མངོན་པར་བསྒྲུབ་པ་དང་། རྒྱས་གདབ་པར་བྱས་ཏེ།
en: He looked upon those entrances to samādhi, identified their characteristics, meditated on them, devoted himself to them, remembered them, pervaded them, made them vast, viewed them, increased them, accomplished them, and sealed them.

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་དེ་དག་ལས་ལངས་ནས་ལྷ་མོ་སྒྱུ་མ་འཁོར་དང་བཅས། གནས་དང་བཅས། སྟན་དང་བཅས་པ་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: He arose from those entrances to samādhi and circumambulated Māyādevī and her entourage, keeping her to his right, and their residence and seats.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བ་ལ་ཡོངས་སུ་བསྐུལ་བ་བགྱིས་པ་སྟེ།
en: Then he stood before her with hands together in homage and said, “Āryā, through Mañjuśrī Kumāra­bhūta I have developed the aspiration for the highest, complete enlightenment and was inspired to honor the kalyāṇamitras.

source: དེ་ལྟར་བདག་དགེ་བའི་བཤེས་གཉེན་ནས་དགེ་བའི་བཤེས་གཉེན་དུ་བསྙེན་བཀུར་བགྱིད་ཅིང་མཐར་གྱིས་ཁྱོད་ཀྱི་ཞབས་ཀྱི་དྲུང་འདིའི་བར་དུ་མཆིས་པ་ལགས་ན།
en: In that way, I have honored one kalyāṇamitra after another and have finally come to your feet.

source: འཕགས་མ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབས་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྲུབ་པ་ལགས།
en: “Āryā, how does a bodhisattva train in bodhisattva conduct and accomplish omniscience?”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པས་རྣམ་པར་བརྒྱན་པ་ཐོབ་པ་སྟེ།
en: Māyādevī answered, “Noble one, I have attained the bodhisattva liberation called the display of the illusory conjurations of wisdom of the great prayers

source: རིགས་ཀྱི་བུ་ཁོ་མོ་རྣམ་པར་ཐར་པ་དེ་དང་ལྡན་པས་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་འདིའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྲིད་པའི་ཐ་མ་ལ་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཇི་སྙེད་ཅིག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྲིད་པའི་ཐ་མ་པ་དེ་དག་ཐམས་ཅད་སོ་སོའི་མར་གྱུར་བ་སྟེ།
en: “Noble one, through possessing that liberation, I have become the mother of each one of all the bodhisattvas in their final existences who are the Bhagavat Vairocana’s miraculous manifestations of being born into the final existences of a bodhisattva in all the Jambudvīpas in all the world realms in this ocean of world realms.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ལྟོ་ན་གནས་པ་ཁོ་མོའི་ལྟོ་གཡས་པ་ནས་འབྱུང་ངོ་།
en: All those bodhisattvas have resided in my belly and emerged from the right side of my belly.

source: །རིགས་ཀྱི་བུ་སྐལ་བ་དང་ལྡན་པའི་གླིང་བཞི་པ་འདི་ཉིད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་སུ་ཡང་། རྒྱལ་པོ་ཟས་གཙང་མའི་བཙུན་མོའི་རིགས་དང་ལྡན་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་དོན་གྲུབ། བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པས་བསྐྱེད་དོ།
en: “Noble one, in the location of the great city of Kapilavastu in this fortunate four-continent world, as a queen in the family of King Śuddhodana, I gave birth to the bodhisattva Siddhārtha in an inconceivable, vast, miraculous manifestation of a bodhisattva’s birth.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་རྒྱལ་པོ་ཟས་གཙང་མའི་ཕོ་བྲང་ན་འདུག་འདུག་པ་ལས་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་ཕོ་བྲང་ནས་འཕོ་བའི་དུས་ལ་བབ་པ་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འོད་ཟེར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུམ་གྱི་ཡོན་ཏན་གྱི་དཀྱིལ་འཁོར་ལས་བྱུང་བའི་སྣང་བ་ཞེས་བྱ་བ་མང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཡུམ་གྱི་ཡོན་ཏན་གྱི་རྒྱན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འཐོན་ནས།
en: “Noble one, while I was living in the palace of King Śuddhodana, the time came for the bodhisattva to leave Tuṣita. From all his pores, from each of his pores, shone many light rays, as numerous as the atoms in countless buddha realms, called the illumination that comes from the field of the qualities of the mothers of all tathāgatas , which were a display of the qualities of the mothers of all bodhisattvas.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བར་བྱས་ཏེ། ཁོ་མོའི་ལུས་ལ་ཤར་ནས། སྤྱི་བོ་མན་ཅད་བ་སྤུའི་བུ་ག་ཐམས་ཅད་དུ་འཕྲོས་པར་གྱུར་ཏོ།
en: They illuminated all world realms and shone upon me, spreading through me from the crown of my head to all the pores of my body.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་མིང་གཅིག་ལ། བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་གྱི་རྣམ་པར་འཕྲུལ་བ་དང་། རྒྱན་དང་རྣམ་པར་ཐར་བ་སྣ་ཚོགས་རབ་ཏུ་འགྱེད་པ་དེ་དག་ཁོ་མོའི་ལུས་སུ་དོང་མ་ཐག་ཏུ་དེའི་མོད་ལ་ཁོ་མོའི་ལུས་སུ་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་གྱི་སྒོའི་དཀྱིལ་འཁོར་གྱིས་རྣམ་པར་དམིགས་པར་བྱས་ཏེ།
en: “Noble one, in that way, the bodhisattva light rays with one name radiated various miraculous manifestations, displays, and liberations of the mothers of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པའི་ཚུལ་དང་རྒྱན་ཐམས་ཅད་ཡོངས་སུ་སྣང་བར་གྱུར་ཏོ།
en: The instant that they entered my body, I perceived in my body the displays and modes of the miraculous births of all bodhisattvas, visible in the fields of the tips of the light rays from the bodhisattva.

source: །ཁྱིམ་དང་འཁོར་ལ་ཡང་དེ་བཞིན་དུ་སྣང་བར་གྱུར་ཏོ།
en: Their residences and their entourages also appeared in that way.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་དེ་དག་ཁོ་མོའི་ལུས་སུ་དོང་མ་ཐག་ཏུ་དེའི་མོད་ལ་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་གྱི་སྒོའི་དཀྱིལ་འཁོར་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གི་སྐྱེ་བའི་ཚུལ་དང་། རྣམ་པར་འཕྲུལ་བ་རྣམ་པར་དམིགས་པར་བྱས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་མཐོང་བར་གྱུར་ཏེ།
en: “Noble one, in that way, the instant those light rays from the bodhisattva entered my body, the field of the tips of the light rays from the bodhisattva made visible to me the miracles and modes of the lives of bodhisattvas, and I saw them all.

source: དེ་དག་ཐམས་ཅད་ཀྱང་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་ནས། སེང་གེའི་གདན་ལ་བཞུགས་ཤིང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱིས་བསྐོར་ཏེ། འཇིག་རྟེན་གྱི་དབང་པོ་རྣམས་ཀྱིས་བསྐོར་ཅིང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མང་པོ་མཐོང་ངོ་།
en: I saw them all going to their bodhimaṇḍas, sitting on their lion thrones encircled by assembled entourages of bodhisattvas, encircled by lords of the world, and turning the wheel of the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བསྙེན་བཀུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་དང་པོ་ཐུགས་བསྐྱེད་པ་དང་། སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། མྱ་ངན་ལས་འདའ་བའི་རྣམ་པར་འཕྲུལ་བ་དང་བཅས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པའི་རྒྱན་དང་བཅས་པར་མཐོང་ངོ་།
en: “I also saw those tathāgatas performing bodhisattva conduct in the past, all their service to tathāgatas, their first development of aspiration to enlightenment, the miracles of their birth, their complete enlightenment, their turning the wheel of the Dharma, the miraculous manifestation of their passing into nirvāṇa, and the display of their pure buddha realms.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སྤྲུལ་པའི་དཀྱིལ་འཁོར་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་མཐོང་བར་གྱུར་ཏོ།
en: “I also saw all the field of the emanations of those tathāgatas filling all the realms of phenomena in each instant.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོའི་ལུས་སུ་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་དེ་དག་དོང་མ་ཐག་ཏུ་ཁོ་མོའི་ལུས་ཀྱང་འགྲོ་བ་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པར་གྱུར་ཏེ།
en: “Noble one, in that way, the instant those light rays from the bodhisattva entered my body, my own body became superior to those of all beings.

source: རུམ་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པར་གྱུར་ཀྱང་མིའི་ལུས་ལས་ལྷག་པར་ཡང་མི་སྣང་ངོ་།
en: My womb became as vast as space, but my body did not appear to transcend being a human body.

source: །ཕྱོགས་བཅུ་ན་བྱང་ཆུབ་སེམས་དཔའི་མངལ་གྱི་གནས་དང་། ཁང་ཁྱིམ་དང་རྒྱན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ལུས་ཀྱི་ཁོངས་སུ་ཆུད་པ་དང་། ཁོ་མོའི་ལུས་སུ་ཤོང་བར་གྱུར་པར་སྣང་བར་གྱུར་ཏོ།
en: “All the displays and residences of the wombs in which dwelled bodhisattvas in the ten directions appeared contained within my body.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོའི་ལུས་སུ་བྱང་ཆུབ་སེམས་དཔའི་མངལ་གྱི་གནས་དང་། ཁང་ཁྱིམ་དང་རྒྱན་དང་ལོངས་སྤྱོད་བྱུང་བར་གྱུར་པ་དང་། དེའི་མོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་གཅིག་པ་སྐལ་བ་མཉམ་པར་སྤྱོད་སྤྱོད་པ། དགེ་བའི་རྩ་བ་གཅིག་པ་རྒྱན་གཅིག་པ།
en: “Noble one, in that way, there appeared in my body the wombs in which the bodhisattvas resided, together with their residences and their enjoyments. In that instant, the bodhisattva and bodhisattvas as numerous as the atoms in ten buddha realms who had the same prayer, the same practice of conduct, the same roots of merit, the same displays;

source: རྣམ་པར་ཐར་པ་གཅིག་ལ་རྣམ་པར་སྤྱོད་པ། ཡེ་ཤེས་ཀྱིས་གཅིག་ལ་གནས་པ། རྣམ་པར་འཕྲུལ་པ་གཅིག་གིས་བྱུང་བ། སྨོན་ལམ་གཅིག་གིས་གྲུབ་པ། སྤྱོད་པ་གཅིག་གིས་བྱུང་བ།
en: who were dwelling in the same liberation, residing on the same level of wisdom, coming forth through the same miraculous manifestations, accomplishing the same prayers, coming forth through the same conduct;

source: ཆོས་ཀྱི་ལུས་ཡོངས་སུ་དག་པ། གཟུགས་ཀྱི་ལུས་མཐའ་དང་དབུས་མེད་པའི་བྱིན་གྱི་རླབས་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་དང་རྣམ་པར་འཕྲུལ་པས་བྱུང་བ་དག་དང་། རིན་པོ་ཆེའི་ཀླུའི་དབང་པོའི་སྙིང་པོའི་ཁང་པ་བརྩེགས་པ་ན་འཁོད་ཅིང་།
en: having purified Dharma bodies and the powerful presence of a vast, centerless, endless extent, of form bodies coming forth through the completely good bodhisattva conduct, prayers, and miraculous manifestations, were seated in the center of the precious kūṭāgāras of the lords of nāgas.

source: ཀླུའི་རྒྱལ་པོ་གང་ཆེན་མཚོ་ལ་སྩོགས་པ་ཀླུའི་དབང་པོ་སྟོང་ཕྲག་བརྒྱད་ཅུ་དང་། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཀྱང་མངོན་པར་མཆོད་ཅིང་།
en: The nāga king Sāgara and eighty thousand other nāga kings and all lords of the world made offerings to them.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་བ་དགའ་ལྡན་གྱི་ཕོ་བྲང་ཐམས་ཅད་ནས་ཤི་འཕོ་ཡོངས་སུ་སྟོན་པས། དགའ་ལྡན་གྱི་གནས་རེ་རེ་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འདལ་བའི་གླིང་བཞི་པར་སྐྱེ་བ་ལེན་པ་ཡོངས་སུ་སྟོན་པ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཐབས་ཀྱི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མཁས་པའི་རྗེས་སུ་སོང་བ་དང་སེམས་ཅན་བག་མེད་པ་ཐམས་ཅད་ཡོངས་སུ་བསྐུལ་ཞིང་མངོན་པར་ཞེན་པ། ཐམས་ཅད་ལས་གྱེན་དུ་བསྐྱོད་པ་དང་། འོད་ཟེར་གྱི་དྲ་བ་ཆེན་པོ་རབ་ཏུ་དགྱེ་བས་འཇིག་རྟེན་གྱི་མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། ངན་སོང་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཞི་བར་བྱེད་པ་དང་། སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ནས་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་ལས་ཡོངས་སུ་བསྐུལ་བ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ལུས་མངོན་པར་སྟོན་པས་དགའ་ལྡན་གྱི་ཕོ་བྲང་ནས་འཕོས་ཏེ།
en: “They displayed the miraculous manifestations of passing away from all the Tuṣita palaces, displayed taking birth from each Tuṣita into a four-continent world throughout all the world realms, acted in accordance with their skill in the inconceivable methods for ripening beings, inspired beings who were careless, brought them up out of all attachments, spread a great network of light rays that dispelled the darkness in all worlds, ended the sufferings in all lower existences, prevented all existences in hells, invoked the past karma of all beings, protected all realms of beings, and displayed their bodies to all beings. “Together they departed from their Tuṣita palaces and with their entourages entered my body.

source: འཁོར་དང་བཅས་པར་ཁོ་མོའི་ལུས་སུ་ཞུགས་ནས་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁོང་ན་གོམ་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་དུ་ཡངས་པ་ནས། འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་ཡངས་པའི་འགྲོས་ཀྱིས་རྒྱུ་ཞིང་སྤྱོད་དོ།
en: All of them moved and walked within my body, their steps ranging from being as wide as a great world realm of a thousand million worlds up to being as wide as world realms as numerous as the atoms in countless buddha realms.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་གི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་བརྗོད་དུ་མེད་པ་དག་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་མངལ་གྱི་གནས་དང་། རྣམ་པར་འཕྲུལ་པ་ལྟ་བའི་ཕྱིར་ཁོ་མོའི་ཁོང་དུ་འདོང་ངོ་།
en: “The countless assembled entourages of bodhisattvas at the feet of tathāgatas in all the vast extent of world realms in the ten directions in each instant came into my body in order to see the miraculous manifestation of the bodhisattva’s residence in the womb.

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། བརྒྱ་བྱིན་དང་རབ་མཚེ་མ་དང་རབ་དགའ་ལྡན་དང་རབ་འཕྲུལ་དགའ་དང་དབང་བསྒྱུར་གྱི་ལྷའི་དབང་པོ་རྣམས་དང་། ཚངས་པ་རྣམས་ཀྱང་མངལ་གྱི་གནས་ན་བཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བ་དང་། ཆོས་མཉན་པའི་གཏམ་ཉམས་སུ་མྱོང་བར་བྱ་བའི་ཕྱིར་ཉེ་བར་དོང་ཡང་ཁོ་མོའི་རུམ་འདིས་དེ་སྙེད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཅིག་ཡོངས་སུ་བཟུང་ཡང་ཡངས་པར་གྱུར་པ་ཡང་མེད།
en: “The Four Mahārājas, Śakra, Suyāma, Saṃtuṣita, Sunirmita, Vaśavartin , the lords of the devas, and the lords of Brahmā devas also entered in order to see the bodhisattva dwelling in a womb, to pay homage to him, honor him, and hear him speak the Dharma. My womb, although it held all those assembled entourages, did not become vast.

source: མིའི་ལུས་ཐ་མལ་པ་ལས་ཁོ་མོའི་ལུས་ཁྱད་པར་ཅན་དུ་གྱུར་བ་ཡང་མེད་མོད་ཀྱི། འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་སྙེད་ཀྱང་ཡོངས་སུ་བཟུང་ངོ་།
en: My body was not different from an ordinary human body, and yet it held all those assembled entourages.

source: །ལྷ་དང་མི་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་སྣ་ཚོགས་དང་། རྒྱན་ཡོངས་སུ་དག་པ་ཡང་མཐོང་བར་གྱུར་ཏོ།
en: “All those devas and humans saw the bodhisattva’s various pure enjoyments and displays.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པ་འདི་ཉིད་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར་རོ།
en: Because I meditated on this bodhisattva liberation called the illusory conjurations of the wisdom of great prayer

source: །རིགས་ཀྱི་བུ་ཇི་ལྟར་ཁོ་མོ་སྐལ་བ་དང་ལྡན་པའི་གླིང་བཞི་པ་འདིའི་འཛམ་བུའི་གླིང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁོང་ན་ཡོངས་སུ་འཛིན་པ་དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གླིང་བཞི་པ་ཐམས་ཅད་ཀྱི་འཛམ་བུའི་གླིང་དག་ན་ཡང་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་གྱི་ཚུལ་འདི་ཉིད་ཀྱིས་ཡོངས་སུ་འཛིན་པར་བྱེད་དེ།
en: “Noble one, just as I held in my body the bodhisattva in the Jambudvīpa of this fortunate four-continent world, in the same way I have held him in this miraculous manner in all the four-continent worlds of the great world realm of a thousand million worlds.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པ་འདི་ཉིད་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར་ཁོ་མོའི་ལུས་འདི་གཉིས་སུ་གྱུར་པའང་མེད། མི་གཉིས་པའང་མེད། གཅིག་ལ་གནས་པ་ཡང་མེད།
en: Because I have meditated on this bodhisattva liberation called the illusory conjurations of the wisdom of great prayer , my body is neither dual nor nondual, and it is neither single nor multiple.

source: མང་པོ་ལ་གནས་པ་ཡང་མེད་དོ། །རིགས་ཀྱི་བུ་ཇི་ལྟར་ཁོ་མོ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་འདིའི་ཡུམ་དུ་གྱུར་པ་དེ་བཞིན་དུ་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་མཐའ་དང་དབུས་མེད་པ་དག་གི་ཡང་ཡུམ་དུ་གྱུར་ཏོ།
en: “Noble one, just as I have been the mother of this Buddha Vairocana, in the same way I have been the mother of a vast extent, without middle or end, of past tathāgatas.

source: །ལ་ལ་ཞིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་པད་མོའི་སྦུབས་ནས་རྫུས་ཏེ་སྐྱེ་བ་ཞིག་ཏུ་གྱུར་ན་ཡང་པད་མོའི་ཚལ་གྱི་ལྷ་མོར་གྱུར་ཅིང་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ལེན་ཏེ། འཇིག་རྟེན་རྣམས་ཀྱིས་ཀྱང་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་ཡིན་པར་ཤེས་སོ།
en: If a bodhisattva was born miraculously from the center of a lotus, I was a goddess of that lotus bed, I acquired that bodhisattva, and I was known in the world as being the bodhisattva’s mother.

source: །ལ་ལ་ཞིག་ཏུ་ཐུ་བར་སྐྱེ་བར་གྱུར་ན་ཡང་དེ་དག་ཏུ་ཡང་ཁོ་མོས་ཐུ་བར་བླངས་ཏེ།
en: If a bodhisattva was born upon my lap, I acquired them from my lap and was the bodhisattva’s mother.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་གྱུར་ཏོ། །ལ་ལ་ཞིག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དེ་བཞིན་འབྱུང་བར་གྱུར་ན་ཡང་དེ་དག་ཏུ་འང་ཁོ་མོ་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོར་གནས་གནས་སོ།
en: If a bodhisattva were in that way born spontaneously in a buddha realm, I would be living there as the goddess of the bodhimaṇḍa.

source: །རིགས་ཀྱི་བུ་ཐབས་ཀྱི་སྒོ་ཇི་སྙེད་ཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྲིད་པའི་ཐ་མ་བ་འཇིག་རྟེན་དུ་འབྱུང་བ་ཡོངས་སུ་སྟོན་པ་དེ་སྙེད་ཀྱི་ཐབས་ཀྱི་སྒོས་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་གྱུར་ཏེ།
en: “Noble one, through various methods I became the mother of the bodhisattvas when they appeared in various ways in the world as their last existence as bodhisattvas.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་བསྟན་པ་དག་ཏུ་ཡུམ་དུ་གྱུར་པ།
en: “Noble one, in this world realm I have been the mother who manifested the miraculous bodhisattva birth of the Bhagavat Vairocana.

source: དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལོག་པ་དད་སེལ་དང་། གསེར་ཐུབ་དང་བསོད་སྐྱབས་ཀྱི་ཡུམ་དུ་ཡང་གྱུར་ཏོ།
en: In the same way, I was the mother of the tathāgatas Krakucchanda, Kanaka­muni, and Kāśyapa.

source: །དེ་བཞིན་དུ་མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་བསྐལ་བ་བཟང་པོ་བ་རྣམས་ཀྱི་ཡང་ཡུམ་དུ་འགྱུར་ཏེ།
en: In the same way, I will be the mother of all the future tathāgatas in this Bhadra kalpa.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་ཤིང་ཤི་འཕོ་ཡོངས་སུ་སྟོན་པའི་དུས་ལ་བབ་པ་དང་། འོད་ཟེར་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྐྱེ་བར་འབྱུང་ཞིང་མངལ་ན་བཞུགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པའི་འོད་བཀྱེ་ནས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ཚུལ་དང་གཞི་རབ་ཏུ་སྣང་བར་བྱས་ཏེ།
en: Thus, when the time comes for the bodhisattva Maitreya, who dwells in the Tuṣita palace, to manifest passing away, he will radiate the light ray of the lights that reveal the miraculous event of the birth, appearance, and dwelling in a womb of all bodhisattvas.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་དང་། གཞི་ཇི་སྙེད་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་མྱིའི་འཇིག་རྟེན་གྱི་མིའི་དབང་པོའི་རིགས་སུ་ཚེར་སྐྱེ་བ་ཡོངས་སུ་བསྟན་པས་སེམས་ཅན་གདུལ་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་དུའང་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་འགྱུར་རོ།
en: The light will go throughout the lands and ways of the entire realm of phenomena and will manifest as that bodhisattva Maitreya who will be born in a human world in the family of a lord of humans in all the lands and ways of the entire realm of phenomena in order to guide beings, and I will be the mother of all those bodhisattvas.
